#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dlnkalyaniorg/demo-github-actions/runs/run-XAfbJXKrhdDjQtwn

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
data.aws_ami.ubuntu: Refreshing...
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-03fbefd0d20e06453]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-03fbefd0d20e06453"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + test        = {
      + architecture          = "x86_64"
      + arn                   = "arn:aws:ec2:us-east-1::image/ami-03fbefd0d20e06453"
      + block_device_mappings = [
          + {
              + device_name  = "/dev/sda1"
              + ebs          = {
                  + delete_on_termination = "true"
                  + encrypted             = "false"
                  + iops                  = "0"
                  + snapshot_id           = "snap-01679ccb87706ce12"
                  + throughput            = "0"
                  + volume_size           = "8"
                  + volume_type           = "gp2"
                }
              + no_device    = ""
              + virtual_name = ""
            },
          + {
              + device_name  = "/dev/sdb"
              + ebs          = {}
              + no_device    = ""
              + virtual_name = "ephemeral0"
            },
          + {
              + device_name  = "/dev/sdc"
              + ebs          = {}
              + no_device    = ""
              + virtual_name = "ephemeral1"
            },
        ]
      + boot_mode             = "legacy-bios"
      + creation_date         = "2023-09-07T00:25:21.000Z"
      + deprecation_time      = "2025-09-07T00:25:21.000Z"
      + description           = "Canonical, Ubuntu, 20.04 LTS, amd64 focal image build on 2023-09-06"
      + ena_support           = true
      + executable_users      = null
      + filter                = [
          + {
              + name   = "name"
              + values = [
                  + "ubuntu/images/hvm-ssd/ubuntu-focal-20.04-amd64-server-*",
                ]
            },
          + {
              + name   = "virtualization-type"
              + values = [
                  + "hvm",
                ]
            },
        ]
      + hypervisor            = "xen"
      + id                    = "ami-03fbefd0d20e06453"
      + image_id              = "ami-03fbefd0d20e06453"
      + image_location        = "amazon/ubuntu/images/hvm-ssd/ubuntu-focal-20.04-amd64-server-20230906"
      + image_owner_alias     = "amazon"
      + image_type            = "machine"
      + imds_support          = ""
      + include_deprecated    = false
      + kernel_id             = ""
      + most_recent           = true
      + name                  = "ubuntu/images/hvm-ssd/ubuntu-focal-20.04-amd64-server-20230906"
      + name_regex            = null
      + owner_id              = "099720109477"
      + owners                = [
          + "099720109477",
        ]
      + platform              = ""
      + platform_details      = "Linux/UNIX"
      + product_codes         = []
      + public                = true
      + ramdisk_id            = ""
      + root_device_name      = "/dev/sda1"
      + root_device_type      = "ebs"
      + root_snapshot_id      = "snap-01679ccb87706ce12"
      + sriov_net_support     = "simple"
      + state                 = "available"
      + state_reason          = {
          + code    = "UNSET"
          + message = "UNSET"
        }
      + tags                  = {}
      + timeouts              = null
      + tpm_support           = ""
      + usage_operation       = "RunInstances"
      + virtualization_type   = "hvm"
    }
  + web-address = (known after apply)

```

</details>

*Pushed by: @dlnkalyani, Action: `pull_request`*